/*
Lection 1 - JavaScript Intro

  1. JS Введение
  2. Подключение скриптов
  3. Консоль разработчика
  4. Переменные + типы(String, Number),  NaN,
  5. Именование переменных
  6. Operators
*/

/*
  # 1. JS Введение
   * LiveScript - JavaScript;
   * JavaScript — это язык программирования, который даёт возможность реализовывать сложное 
     поведение веб-страницы. Является интерпретируемым языком.
   * Интерпретация – это когда исходный код программы получает другой инструмент, который называют «интерпретатор», 
     выполняет его «как есть». При этом распространяется именно сам исходный код (скрипт). 
     Этот подход применяется в браузерах для JavaScript. 
*/

